Revit 2027 API
ExtrusionAnalyzer.EndParameter Property
 The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndParameter { get; }
Public ReadOnly Property EndParameter As Double
	Get
public:
property double EndParameter {
	double get ();
}
member EndParameter : float with get
Property Value
Double
See Also
Reference
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace